<template>
    <section class="first sector">
        <div class="hero">
            <div class="hero-logo">
                <svg width="400" height="255" viewBox="0 0 400 255" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M5.74414 254.058V199.021H15.7142V224.309H16.386L37.8579 199.021H50.0316L28.7478 223.718L50.2197 254.058H38.2342L21.8145 230.463L15.7142 237.665V254.058H5.74414Z" fill="#5F8484"/>
                    <path d="M91.6519 199.021H101.622V234.978C101.622 238.919 100.69 242.386 98.8271 245.378C96.9818 248.37 94.384 250.708 91.0338 252.392C87.6836 254.058 83.769 254.891 79.2901 254.891C74.7933 254.891 70.8697 254.058 67.5195 252.392C64.1693 250.708 61.5715 248.37 59.7262 245.378C57.8809 242.386 56.9582 238.919 56.9582 234.978V199.021H66.9283V234.145C66.9283 236.438 67.4299 238.48 68.4332 240.272C69.4544 242.063 70.8877 243.47 72.733 244.491C74.5783 245.494 76.764 245.996 79.2901 245.996C81.8162 245.996 84.0019 245.494 85.8472 244.491C87.7104 243.47 89.1437 242.063 90.147 240.272C91.1503 238.48 91.6519 236.438 91.6519 234.145V199.021Z" fill="#5F8484"/>
                    <path d="M112.459 254.058V199.021H133.097C137.326 199.021 140.873 199.756 143.739 201.225C146.624 202.694 148.801 204.754 150.27 207.406C151.757 210.039 152.5 213.112 152.5 216.623C152.5 220.153 151.748 223.216 150.243 225.814C148.756 228.394 146.561 230.391 143.659 231.807C140.756 233.204 137.191 233.903 132.963 233.903H118.263V225.626H131.619C134.092 225.626 136.116 225.285 137.693 224.605C139.269 223.906 140.434 222.894 141.186 221.568C141.957 220.224 142.342 218.576 142.342 216.623C142.342 214.67 141.957 213.004 141.186 211.625C140.416 210.227 139.243 209.17 137.666 208.454C136.089 207.719 134.056 207.352 131.566 207.352H122.429V254.058H112.459ZM140.891 229.119L154.516 254.058H143.39L130.007 229.119H140.891Z" fill="#5F8484"/>
                    <path d="M210.856 226.539C210.856 232.47 209.745 237.549 207.524 241.777C205.32 245.987 202.31 249.212 198.494 251.451C194.696 253.691 190.387 254.81 185.568 254.81C180.749 254.81 176.431 253.691 172.615 251.451C168.817 249.194 165.807 245.96 163.585 241.75C161.382 237.522 160.28 232.452 160.28 226.539C160.28 220.609 161.382 215.539 163.585 211.329C165.807 207.101 168.817 203.867 172.615 201.628C176.431 199.388 180.749 198.269 185.568 198.269C190.387 198.269 194.696 199.388 198.494 201.628C202.31 203.867 205.32 207.101 207.524 211.329C209.745 215.539 210.856 220.609 210.856 226.539ZM200.832 226.539C200.832 222.365 200.178 218.845 198.87 215.978C197.58 213.094 195.789 210.917 193.496 209.448C191.202 207.961 188.56 207.217 185.568 207.217C182.576 207.217 179.933 207.961 177.64 209.448C175.347 210.917 173.547 213.094 172.239 215.978C170.949 218.845 170.304 222.365 170.304 226.539C170.304 230.714 170.949 234.243 172.239 237.128C173.547 239.994 175.347 242.171 177.64 243.658C179.933 245.127 182.576 245.861 185.568 245.861C188.56 245.861 191.202 245.127 193.496 243.658C195.789 242.171 197.58 239.994 198.87 237.128C200.178 234.243 200.832 230.714 200.832 226.539Z" fill="#5F8484"/>
                    <path d="M250.192 214.151C249.941 211.804 248.884 209.976 247.021 208.669C245.176 207.361 242.775 206.707 239.819 206.707C237.741 206.707 235.958 207.02 234.471 207.647C232.984 208.274 231.846 209.125 231.058 210.2C230.27 211.275 229.867 212.503 229.849 213.882C229.849 215.029 230.108 216.023 230.628 216.865C231.165 217.707 231.891 218.424 232.805 219.015C233.718 219.588 234.731 220.072 235.841 220.466C236.952 220.86 238.072 221.192 239.201 221.46L244.36 222.75C246.439 223.234 248.436 223.888 250.353 224.712C252.288 225.536 254.017 226.575 255.54 227.829C257.08 229.083 258.299 230.597 259.195 232.371C260.09 234.145 260.538 236.223 260.538 238.606C260.538 241.83 259.714 244.67 258.066 247.125C256.418 249.561 254.035 251.469 250.917 252.849C247.818 254.21 244.065 254.891 239.658 254.891C235.376 254.891 231.658 254.228 228.505 252.902C225.37 251.577 222.915 249.642 221.142 247.098C219.386 244.554 218.436 241.454 218.293 237.799H228.102C228.245 239.716 228.836 241.311 229.876 242.583C230.915 243.855 232.267 244.804 233.933 245.431C235.618 246.059 237.499 246.372 239.577 246.372C241.745 246.372 243.644 246.05 245.274 245.405C246.922 244.742 248.212 243.828 249.144 242.664C250.075 241.481 250.55 240.102 250.568 238.525C250.55 237.092 250.129 235.909 249.305 234.978C248.481 234.028 247.325 233.24 245.838 232.613C244.369 231.968 242.649 231.395 240.679 230.893L234.417 229.281C229.885 228.116 226.301 226.351 223.668 223.986C221.052 221.604 219.744 218.442 219.744 214.5C219.744 211.257 220.622 208.418 222.378 205.981C224.152 203.545 226.561 201.655 229.607 200.311C232.652 198.949 236.101 198.269 239.953 198.269C243.859 198.269 247.281 198.949 250.219 200.311C253.175 201.655 255.495 203.527 257.179 205.927C258.863 208.31 259.732 211.051 259.786 214.151H250.192Z" fill="#5F8484"/>
                    <path d="M269.427 254.058V199.021H279.397V222.32H304.9V199.021H314.896V254.058H304.9V230.678H279.397V254.058H269.427Z" fill="#5F8484"/>
                    <path d="M335.71 199.021V254.058H325.74V199.021H335.71Z" fill="#5F8484"/>
                    <path d="M395.685 226.539C395.685 232.47 394.574 237.549 392.353 241.777C390.149 245.987 387.139 249.212 383.323 251.451C379.525 253.691 375.216 254.81 370.397 254.81C365.578 254.81 361.26 253.691 357.444 251.451C353.646 249.194 350.636 245.96 348.414 241.75C346.211 237.522 345.109 232.452 345.109 226.539C345.109 220.609 346.211 215.539 348.414 211.329C350.636 207.101 353.646 203.867 357.444 201.628C361.26 199.388 365.578 198.269 370.397 198.269C375.216 198.269 379.525 199.388 383.323 201.628C387.139 203.867 390.149 207.101 392.353 211.329C394.574 215.539 395.685 220.609 395.685 226.539ZM385.661 226.539C385.661 222.365 385.007 218.845 383.699 215.978C382.409 213.094 380.618 210.917 378.325 209.448C376.031 207.961 373.389 207.217 370.397 207.217C367.405 207.217 364.762 207.961 362.469 209.448C360.176 210.917 358.375 213.094 357.068 215.978C355.778 218.845 355.133 222.365 355.133 226.539C355.133 230.714 355.778 234.243 357.068 237.128C358.375 239.994 360.176 242.171 362.469 243.658C364.762 245.127 367.405 245.861 370.397 245.861C373.389 245.861 376.031 245.127 378.325 243.658C380.618 242.171 382.409 239.994 383.699 237.128C385.007 234.243 385.661 230.714 385.661 226.539Z" fill="#5F8484"/>
                    <path d="M48.7907 45.2948V55.4947H145.11V45.2948H48.7907ZM48.7907 20.3999V30.5999H145.11V20.3999H48.7907ZM24.6057 4.84066H170.557V71.2269H24.6057V4.84066ZM19.1377 79.1794H176.446V95.4302H19.1377V79.1794ZM1.68244 104.247H192.219V121.535H1.68244V104.247ZM83.4911 11.9288H108.517V115.139H83.4911V11.9288ZM60.7781 131.216L83.9117 129.661C85.0333 134.155 86.0147 139.111 86.8559 144.528C87.6972 149.945 88.1178 154.498 88.1178 158.186L63.5121 160.606C63.5121 156.803 63.3018 152.135 62.8812 146.603C62.4606 141.186 61.7595 136.057 60.7781 131.216ZM102.208 131.908L125.762 128.105C128.006 132.484 130.179 137.325 132.282 142.627C134.385 147.813 135.857 152.308 136.698 156.111L111.672 160.606C111.111 156.918 109.919 152.366 108.097 146.949C106.274 141.532 104.311 136.518 102.208 131.908ZM143.638 130.871L167.403 124.474C170.627 127.355 173.922 130.64 177.287 134.328C180.792 137.901 184.017 141.474 186.961 145.047C189.905 148.505 192.219 151.732 193.901 154.728L168.454 161.989C167.052 159.338 164.949 156.169 162.145 152.481C159.481 148.908 156.467 145.22 153.102 141.416C149.877 137.613 146.723 134.098 143.638 130.871ZM22.9232 124.647L47.3186 129.488C44.9352 135.481 41.7105 141.416 37.6446 147.294C33.5787 153.288 29.0221 158.244 23.9748 162.162L0 153.518C4.76691 150.406 9.18332 146.199 13.2492 140.898C17.3151 135.596 20.5398 130.179 22.9232 124.647Z" fill="white"/>
                    <path d="M282.019 80.7353V89.7251H309.148V80.7353H282.019ZM282.019 58.7795V67.5964H309.148V58.7795H282.019ZM261.83 44.7761H329.968V103.728H261.83V44.7761ZM377.708 5.35931H400V138.477C400 143.088 399.439 146.891 398.318 149.888C397.336 152.884 395.233 155.189 392.008 156.803C388.644 158.416 384.648 159.454 380.021 159.915C375.535 160.376 369.996 160.606 363.407 160.606C363.267 158.762 362.846 156.63 362.145 154.21C361.444 151.905 360.673 149.542 359.832 147.122C358.991 144.701 358.079 142.627 357.098 140.898C360.603 141.013 364.038 141.071 367.403 141.071C370.768 141.071 373.081 141.071 374.343 141.071C375.605 141.071 376.446 140.898 376.866 140.552C377.427 140.091 377.708 139.227 377.708 137.959V5.35931ZM338.591 5.35931H360.673V76.0675C360.673 82.637 360.393 89.7827 359.832 97.5047C359.411 105.112 358.43 112.834 356.887 120.671C355.485 128.393 353.312 135.827 350.368 142.972C347.564 150.118 343.849 156.515 339.222 162.162C337.96 161.01 336.207 159.684 333.964 158.186C331.721 156.803 329.408 155.42 327.024 154.037C324.641 152.769 322.538 151.789 320.715 151.098C326.323 144.183 330.389 136.461 332.913 127.932C335.436 119.403 336.979 110.644 337.539 101.654C338.24 92.5488 338.591 84.02 338.591 76.0675V5.35931ZM348.686 5.35931H388.433V23.8575H348.686V5.35931ZM348.686 44.7761H387.592V63.2744H348.686V44.7761ZM259.516 17.1152H332.282V34.749H259.516V17.1152ZM255.941 114.274H332.913V132.427H255.941V114.274ZM348.686 84.7116H387.592V103.21H348.686V84.7116ZM284.753 0H307.676V51.1727H284.753V0ZM284.753 101.135H307.676V161.644H284.753V101.135ZM212.829 13.3118L229.232 1.03728C232.737 2.9966 236.383 5.30168 240.168 7.95252C244.094 10.4881 247.739 13.0237 251.104 15.5593C254.609 18.0948 257.483 20.4576 259.727 22.6474L242.271 36.305C240.308 33.9999 237.645 31.5219 234.28 28.8711C231.055 26.105 227.55 23.3389 223.764 20.5728C219.979 17.8067 216.334 15.3864 212.829 13.3118ZM205.889 58.6066L220.82 45.2948C224.606 47.1388 228.601 49.2134 232.808 51.5185C237.014 53.7083 241.009 56.0134 244.795 58.4337C248.721 60.7388 251.875 62.871 254.259 64.8303L238.696 79.698C236.453 77.7387 233.438 75.4913 229.653 72.9557C226.008 70.4201 222.082 67.8845 217.876 65.3489C213.67 62.8133 209.674 60.5659 205.889 58.6066ZM210.095 150.406C212.758 145.45 215.563 139.745 218.507 133.291C221.451 126.837 224.395 119.979 227.34 112.718C230.424 105.342 233.158 98.081 235.542 90.9353L255.52 100.962C253.417 107.532 251.034 114.274 248.37 121.189C245.846 127.989 243.253 134.674 240.589 141.244C237.925 147.813 235.191 154.094 232.387 160.088L210.095 150.406Z" fill="white"/>
                </svg>
            </div>
        </div>
    </section>
    <section class="second sector">
        <div class="sector-title">Популярные блюда</div>
        <div class="sector-subtitle">人気の料理</div>
        <div class="specials">
            <div class="special">
                <div class="special-img">
                    <img src="@/assets/images/ramen/Shoyu-Ramen-with-Chicken.jpg" alt="">
                </div>
                <div class="special-title">Сею Рамен с курицей</div>
                <div class="special-description">Легкий куриный бульон, лапша рамен, соус сею, куриное филе су-вид, маринованное яйцо, редис, лук порей маринованный, лист нори.</div>
                <div class="special-price">730 р</div>
                <div class="special-bottom-part">
                    <router-link :to="{ name: 'Menu' }">
                        <button class="special-btn">Перейти в меню</button>
                    </router-link>
                    <div class="special-add-to-order">
                        <p>Добавить в заказ</p>
                        <button class="special-add-to-order-btn">+</button>
                    </div>
                </div>
            </div>
            <div class="special">
                <div class="special-img">
                    <img src="@/assets/images/snacks/Tempura-Prawns.jpg" alt="">
                </div>
                <div class="special-title">Креветки темпура</div>
                <div class="special-description">Креветки, обжаренные в панировке с соусом спайс, соусом унаги, кунжутом, икрой тобико, подаются с водорослями нори.</div>
                <div class="special-price">510 р</div>
                <div class="special-bottom-part">
                    <router-link :to="{ name: 'Menu' }">
                        <button class="special-btn">Перейти в меню</button>
                    </router-link>
                    <div class="special-add-to-order">
                        <p>Добавить в заказ</p>
                        <button class="special-add-to-order-btn">+</button>
                    </div>
                </div>
            </div>
            <div class="special">
                <div class="special-img">
                    <img src="@/assets/images/rice/Vegetable-Rice-with-egg.jpg" alt="">
                </div>
                <div class="special-title">Рис с овощами и яйцом</div>
                <div class="special-description">Обжаренный рис с овощами (кабачок, баклажан, шампиньоны, капуста) с соусом терияки блэк гарлик, яичницей-глазуньей и битыми огурцами.</div>
                <div class="special-price">480 р</div>
                <div class="special-bottom-part">
                    <router-link :to="{ name: 'Menu' }">
                        <button class="special-btn">Перейти в меню</button>
                    </router-link>                    
                    <div class="special-add-to-order">
                        <p>Добавить в заказ</p>
                        <button class="special-add-to-order-btn">+</button>
                    </div>
                </div>
            </div>
        </div>
    </section>
    <section class="third sector">
        <div class="sector-title">О нас</div>
        <div class="sector-subtitle">会社概要</div>
        <div class="about">
            <div class="about-text">Добро пожаловать в KUROSHIO — японский ресторан, где традиции встречаются с актуальными трендами. Мы создали пространство для тех, кто ценит стиль, динамику и смелые гастрономические эксперименты.</div>
            <div class="about-text">Здесь нет строгих рамок — только живая энергия Токио, заряженная в детали интерьера, музыку и, конечно, в наше меню. Лаконичный дизайн, открытая кухня и атмосфера непринуждённого общения делают KUROSHIO местом, где хочется остаться надолго.</div>
            <div class="about-text">KUROSHIO — для тех, кто ищет не просто ужин, а впечатления. Заходите, чтобы почувствовать ритм современной Японии.</div>
            <div class="about-imgs">
                <div class="about-img about-img-1"></div>
                <div class="about-img about-img-2"></div>
                <div class="about-img about-img-3"></div>
                <div class="about-img about-img-4"></div>
            </div>
        </div>
    </section>
</template>

<script>
</script>

<style>
* {
margin: 0;
padding: 0;
}

html, body {
    overflow-x: hidden;
    width: 100%;
    background-color: #0E0E0E;
    font-family: "Instrument Sans", sans-serif;
}

.sector {
    width: 100vw;
    height: 100vh;
}

.first {
    background-color: #0E0E0E;
    display: flex;
    align-items: center;
    justify-content: center;
    margin-left: 0;
}

.hero {
    width: 100vw;
    height: 454px;
    background-image: url("@/assets/images/main-image30.png");
    margin-top: 60px;
    display: flex;
    align-items: center;
    justify-content: center;
}

.hero-logo {
    z-index: 1;
}

.second {
    background-color: #0E0E0E;
}

.sector-title {
    padding-top: calc(80px + 20px);
    margin-left: 80px;
    font-weight: normal;
    font-size: 34px;
}

.sector-subtitle {
    margin-left: 80px;
    font-weight: normal;
    font-size: 20px;
    color: #5F8484;
}

.specials {
    margin-left: 80px;
    margin-right: 80px;
    padding-top: 20px;
    display: flex;
    align-items: center;
    justify-content: center;
    gap: 20px;
}

.special {
    width: 400px;
    height: 380px;
    border: 2px solid #5F8484;
    border-radius: 24px;
    text-align: justify;
}

.special-img > img{
    width: 100%;
    border-top-left-radius: 24px;
    border-top-right-radius: 24px;
}

.special-title {
    font-size: 16px;
    margin-left: 10px;
}

.special-description {
    font-size: 10px;
    margin: 10px;
}

.special-price {
    font-size: 14px;
    margin-left: 10px;
    color: #5F8484;
}

.special-bottom-part {
    width: 100%;
    display: flex;
    align-items: center;
    margin-top: 10px;
    justify-content: center;
    gap: 40px;
}

.special-btn {
    width: 150px;
    height: 40px;
    /* margin-left: 10px; */
    font-size: 14px;
    color: #5F8484;
}

.special-add-to-order {
    display: flex;
    font-size: 14px;
    align-items: center;
    justify-content: center;
    gap: 10px;
}

.special-add-to-order-btn {
    width: 20px;
    height: 20px;
    color: #5F8484;
    border-radius: 14px !important;
}

button {
    background-color: #0E0E0E;
    border: 2px solid #5F8484;
    border-radius: 10px;
    cursor: pointer;
}

.about-text {
    margin-left: 80px;
    margin-right: 80px;
    margin-top: 20px;
    text-align: justify;
    font-size: 22px;
}

.about-imgs {
    display: flex;
    margin-left: 80px;
    margin-right: 80px;
    margin-top: 20px;
    align-items: center;
    justify-content: center;
    gap: 30px;
}

.about-img {
    border: 2px solid #5F8484;
    border-radius: 10px;
    width: 300px;
    height: 140px;
    background-size: cover;
}

.about-img-1 {
    background-image: url("../assets/images/about/about-img-1.jpg");
}

.about-img-2 {
    background-image: url("../assets/images/about/about-img-2.jpg");
}

.about-img-3 {
    background-image: url("../assets/images/about/about-img-3.jpg");
}

.about-img-4 {
    background-image: url("../assets/images/about/about-img-4.jpg");
}
</style>